public class Main {
    public static void main(String[] args) {
        //Массивы Часть 1

        //Задача 1: Объявить три массива:
        //1. Целочисленный массив, заполненный тремя цифрами – 1, 2 и 3 – с помощью ключевого слова new.
        //2. Массив, в котором можно хранить три дробных числа – 1.57, 7.654, 9.986 –  сразу заполнив его значениями.
        //3. Произвольный массив – тип и количество данных определите сами. Самостоятельно выберите способ
        // создания массива: с помощью ключевого слова или сразу заполненный элементами.
        int [] three = new int [3];
        three [0] = 1;
        three [1] = 2;
        three [2] = 3;
        float [] distance = {1.57F, 7.654F, 9.986F};
        int [] numbersFibonacci = {0, 1, 1, 2, 3, 5, 8, 13, 21, 34};
    }
}